<template>
    <h4>Задай себе эти 4 вопроса — если хоть на один ответ «да», скорее всего, нужен Perfect: </h4>
    <ul>
        <li>«Есть ли результат, который важен прямо сейчас?»</li>
        <li>«Речь идёт о жизненном опыте (ever/never/before)?»</li>
        <li>«Есть маркер времени, который связывает прошлое с настоящим?» - Слова before, yet,
            already, so far, up to now прямо указывают на связь с моментом речи.
        </li>
        <li>«Действие могло произойти в любой момент до сейчас, и точное время не важно?» -
            Если ты не говоришь «в 2022 году» или «на прошлой неделе», а просто «раньше/никогда
            до
            этого», это тоже маркер Perfect.</li>
    </ul>

    Если все ответы «нет», чаще нужен Past Simple.
</template>
