<template>
    <div class="pa-4">
        <h2 class="text-center">About</h2>

        <v-row><v-col>Шаблоны кода на VUE. Pet проекты. Тестирование функций.</v-col></v-row>
        <v-row><v-col>В пэт проекте English B нужно правильно выбрать время предложения.</v-col></v-row>
        <v-row><v-col>Пэт проект конверсии маркдаун шаблона в JSON предназначен для превращения подготовленных Алисой
                или Дипсиком текстовых данных в формат тренажера Английского языка</v-col></v-row>
        <v-row><v-col>Для верстки визуальных компонентов использовался vuetify</v-col></v-row>

        <v-row><v-col>Компоненты разбивались для лучшего покрытия тестами. Отделена логика хранения данных и логика
                отображения данных.
                Использовалось локальное хранилище для сохранения промежуточных результатов. После рефреша страницы
            </v-col></v-row>

        <v-row><v-col>Автор - Сергей Михайлов +7 918 125 52 05 serge_mikhailov@mail.ru - программист VUE (NUXT) 6+
                лет</v-col></v-row>
        <v-row><v-col></v-col></v-row>
        <v-row><v-col></v-col></v-row>
        <v-row><v-col></v-col></v-row>
    </div>
</template>

<script setup lang="ts">
</script>